Repository: AlekSIS-org/AlekSIS-App-Untis
Catalog: aleksis/apps/untis/locale/*/LC_MESSAGES/django.po
Languages: de_de

source: Path to Untis XML export file
de_de: Pfad zur Untis-XML-Exportdatei

source: Units import
de_de: Untis-Import

source: Import Untis data
de_de: Untis-Daten importieren

source: Newly imported data will be valid as of tomorrow.
de_de: Neu importierte Daten sind ab morgen gültig.

source: The effective dates of all existing lessons will be set to end today.
de_de: Die Gültigkeitsdauer aller vorhandenen Schulstunden endet heute.

source: The effective dates of all newly imported lessons will be set to start tomorrow.
de_de: Die Gültigkeitsdauer aller neu-importierten Schulstunden startet morgen.

source: Teachers, rooms, subjects and classes and periods will be updated in place.
de_de: Lehrer, Räume, Fächer und Klassen und Schulstunden werden aktualisiert.

source: Class %s
de_de: Klasse %s

source: Could not set class teacher of %(class)s to %(teacher)s.
de_de: Der Klassenlehrer von %(class)s konnte nicht auf %(teacher)s gesetzt werden.

source: Invalid list of classes: %s
de_de: Ungültige Liste von Klassen: %s

source: Failed to import lesson: Teacher %s does not exist.
de_de: Fehler beim Importieren der Stunde: Lehrer %s existiert nicht.
